drowe67/codec2-dev/codec2-dev/stm32/src/si53xx.c
/*------------------------------------------------------------------------------
 * 
 * Ported to stm32F4xx non c++ by Leon Lessing leon@lrlabs.com or zs6lmg@gmail.com
 * 
 * 
 * Copyright (C) 2015-2016 Jason Milldrum <milldrum@gmail.com>
 *                         Dana H. Myers <k6jq@comcast.net>
 *
 * Many defines derived from clk-si5351.h in the Linux kernel.
 * Sebastian Hesselbarth <sebastian.hesselbarth@gmail.com>
 * Rabeeh Khoury <rabeeh@solid-run.com>
 *
 * do_div() macro derived from /include/asm-generic/div64.h in
 * the Linux kernel.
 * Copyright (C) 2003 Bernardo Innocenti <bernie@develer.com>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 * 
 * 
 *------------------------------------------------------------------------------
*/

#include "stm32f4xx.h"
#include "stm32f4xx_conf.h"
//#include "system.h"

#include "new_i2c.h"
//#include "inc/xprintf.h"
#include "stdlib.h"
#include "string.h"
#include "math.h"
#include "si53xx.h"


void si5351_write(uint8_t REGaddr, uint8_t data) {
    // ignoring errors
    // Waiting for the bite
    Si5351_Config.I2C_ErrorCode=I2C_NewWriteRegister(Si5351_Config.I2C_add, REGaddr, data);
}

void si5351_write_bulk(uint8_t REGaddr, uint8_t bytes, uint8_t *data) {
    Si5351_Config.I2C_ErrorCode=I2C_NewWriteRegisterN(Si5351_Config.I2C_add, REGaddr, data, bytes);
}


uint8_t si5351_read(uint8_t REGaddr) {
    uint8_t reg_val;
    Si5351_Config.I2C_ErrorCode=I2C_NewReadRegister(Si5351_Config.I2C_add,REGaddr);
    if (Si5351_Config.I2C_ErrorCode>0xff) {
        reg_val=0;
    } else {
        reg_val=(uint8_t)(Si5351_Config.I2C_ErrorCode & 0xff);
        Si5351_Config.I2C_ErrorCode=0;
    }
    return reg_val;
}

/*------------------------------------------------------------------------------
 * @brief si5351_init(uint8_t xtal_load_c, uint32_t ref_osc_freq)
 * Setup communications to the Si5351 and set the crystal
 * load capacitance.
 *
 * @param I2C_Address - enter I2C address here, use 0 to use .h file defined value
 * 
 * @param xtal_load_c - Crystal load capacitance. Use the SI5351_CRYSTAL_LOAD_*PF
 * defines in the header file
 * 
 * @param ref_osc_freq - Crystal/reference oscillator frequency in 1 Hz increments.
 * Defaults to 25000000 if a 0 is used here.
 * 
 *------------------------------------------------------------------------------
 */
void si5351_init(uint8_t I2C_Address, uint8_t xtal_load_c, uint32_t ref_osc_freq) {
    Si5351_Config.clk0_freq=0;
    Si5351_Config.lock_plla = SI5351_CLKNONE;
    Si5351_Config.lock_pllb = SI5351_CLKNONE;
    Si5351_Config.clk0_int_mode = 0;
    Si5351_Config.clk1_int_mode = 0;
    Si5351_Config.clk2_int_mode = 0;
    Si5351_Config.plla_freq = 0;
    Si5351_Config.pllb_freq = 0;
    Si5351_Config.clk0_freq = 0;
    Si5351_Config.clk1_freq = 0;
    Si5351_Config.clk2_freq = 0;
    Si5351_Config.xtal_freq = SI5351_XTAL_FREQ;
    Si5351_Config.I2C_add = SI5351_BUS_BASE_ADDR << 1;
    if (I2C_Address != 0) Si5351_Config.I2C_add=I2C_Address << 1;
    // Set crystal load capacitance
    uint8_t reg_val = 0x12; // 0b010010 reserved value bits
    reg_val |= xtal_load_c;
    si5351_write(SI5351_CRYSTAL_LOAD, reg_val);
    // Change the ref osc freq if different from default
    // Divide down if greater than 30 MHz
    if (ref_osc_freq != 0) {
        uint8_t reg_val;
        reg_val = si5351_read(SI5351_PLL_INPUT_SOURCE);
        //
        // Clear the bits first
        reg_val &= ~(SI5351_CLKIN_DIV_MASK);
        if(ref_osc_freq <= 30000000) {
            Si5351_Config.xtal_freq = ref_osc_freq;
            reg_val |= SI5351_CLKIN_DIV_1;
        } else if(ref_osc_freq > 30000000 && ref_osc_freq <= 60000000) {
            Si5351_Config.xtal_freq = ref_osc_freq / 2;
            reg_val |= SI5351_CLKIN_DIV_2;
        } else if(ref_osc_freq > 60000000 && ref_osc_freq <= 100000000) {
            Si5351_Config.xtal_freq = ref_osc_freq / 4;
            reg_val |= SI5351_CLKIN_DIV_4;
        }
        si5351_write(SI5351_PLL_INPUT_SOURCE, reg_val);
    }
    // Initialize the CLK outputs according to flowchart in datasheet
    // First, turn them off
    si5351_write(16, 0x80);
    si5351_write(17, 0x80);
    si5351_write(18, 0x80);

    // Turn the clocks back on...
    si5351_write(16, 0x0c);
    si5351_write(17, 0x0c);
    si5351_write(18, 0x0c);

    // Then reset the PLLs
    si5351_pll_reset(SI5351_PLLA);
    si5351_pll_reset(SI5351_PLLB);
}




/*------------------------------------------------------------------------------
 * @brief si5351_set_freq(uint64_t freq, uint64_t pll_freq, enum si5351_clock output)
 * Sets the clock frequency of the specified CLK output
 *
 * @param freq - Output frequency in Hz
 * 
 * @param pll_freq - Frequency of the PLL driving the Multisynth
 *   Use a 0 to have the function choose a PLL frequency
 * 
 * @param clk - Clock output
 *   (use the si5351_clock enum)
 *------------------------------------------------------------------------------
 */
uint8_t si5351_set_freq(uint64_t freq, uint64_t pll_freq, enum si5351_clock clk) {
    struct Si5351RegSet ms_reg;
    enum si5351_pll target_pll;
    uint8_t write_pll = 0;
    uint8_t r_div = SI5351_OUTPUT_CLK_DIV_1;
    uint8_t int_mode = 0;
    uint8_t div_by_4 = 0;

    // PLL bounds checking
    if(pll_freq != 0) {
        if ((pll_freq < SI5351_PLL_VCO_MIN * SI5351_FREQ_MULT)
                || (pll_freq > SI5351_PLL_VCO_MAX * SI5351_FREQ_MULT)) {
            return 1;
        }
    }

    // Lower bounds check
    if(freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT) {
        freq = SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT;
    }

    // Upper bounds check
    if(freq > SI5351_MULTISYNTH_MAX_FREQ * SI5351_FREQ_MULT) {
        freq = SI5351_MULTISYNTH_MAX_FREQ * SI5351_FREQ_MULT;
    }

    // Select the proper R div value
    r_div = si5351_select_r_div(&freq);

    // Calculate the synth parameters
    // If pll_freq is 0 and freq < 150 MHz, let the algorithm pick a PLL frequency
    if ((pll_freq) && (freq < SI5351_MULTISYNTH_DIVBY4_FREQ * SI5351_FREQ_MULT)) {
        si5351_multisynth_calc(freq, pll_freq, &ms_reg);
        write_pll = 0;
        div_by_4 = 0;
        int_mode = 0;

        switch(clk)      {
            case SI5351_CLK0:
                    Si5351_Config.clk0_freq = freq;
                    break;
            case SI5351_CLK1:
                    Si5351_Config.clk1_freq = freq;
                    break;
            case SI5351_CLK2:
                    Si5351_Config.clk2_freq = freq;
                    break;
            default:
                    break;
        }
    } else {
        // The PLL must be calculated and set by firmware when 150 MHz <= freq <= 160 MHz
        if(freq >= SI5351_MULTISYNTH_DIVBY4_FREQ * SI5351_FREQ_MULT) {
            pll_freq = si5351_multisynth_calc(freq, 0, &ms_reg);
            write_pll = 1;
            div_by_4 = 1;
            int_mode = 1;
        }

