drowe67/codec2-dev/codec2-dev/stm32/src/si53xx.c
        // Determine which PLL to use
        // CLK0 gets PLLA, CLK1 gets PLLB
        // CLK2 gets PLLB if necessary
        // Only good for Si5351A3 variant at the moment
        switch(clk) {
            case SI5351_CLK0:
                    pll_freq = si5351_multisynth_calc(freq, 0, &ms_reg);
                    target_pll = SI5351_PLLA;
                    write_pll = 1;
                    si5351_set_ms_source(SI5351_CLK0, SI5351_PLLA);

                    Si5351_Config.plla_freq = pll_freq;
                    Si5351_Config.clk0_freq = freq;
                    break;
            case SI5351_CLK1:
                    // Check to see if PLLB is locked due to other output being < 1.024 MHz or >= 112.5 MHz
                    if(Si5351_Config.lock_pllb == SI5351_CLK2) {
                        // We can't have a 2nd output < 1.024 MHz or >= 112.5 MHz on the same PLL unless exact same freq, so exit
                        if((freq >= SI5351_MULTISYNTH_SHARE_MAX * SI5351_FREQ_MULT
                                || freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 128)
                                && freq != Si5351_Config.clk2_freq) {
                            Si5351_Config.clk1_freq = 0;
                            return 1;
                        } else {
                            // Else, set multisynth to same PLL freq as CLK2
                            pll_freq = Si5351_Config.pllb_freq;
                            si5351_multisynth_calc(freq, pll_freq, &ms_reg);
                            write_pll = 0;
                            si5351_set_ms_source(SI5351_CLK1, SI5351_PLLB);
                        }
                    } else {
                        Si5351_Config.pllb_freq = pll_freq;
                        pll_freq = si5351_multisynth_calc(freq, 0, &ms_reg);
                        write_pll = 1;
                        si5351_set_ms_source(SI5351_CLK1, SI5351_PLLB);
                    }

                    if(freq >= SI5351_MULTISYNTH_SHARE_MAX * SI5351_FREQ_MULT
                            || freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 128) {
                        Si5351_Config.lock_pllb = SI5351_CLK1;

                        // Recalc and rewrite the multisynth parameters on CLK2
                        if(Si5351_Config.clk2_freq != 0) {
                            struct Si5351RegSet ms_temp_reg;
                            r_div = si5351_select_r_div(&Si5351_Config.clk2_freq);
                            si5351_multisynth_calc(Si5351_Config.clk2_freq, \
                                    Si5351_Config.pllb_freq, &ms_temp_reg);
                            si5351_set_ms(SI5351_CLK2, ms_temp_reg, 0, r_div, 0);
                        }
                    } else {
                        Si5351_Config.lock_pllb = SI5351_CLKNONE;
                    }

                    target_pll = SI5351_PLLB;
                    Si5351_Config.clk1_freq = freq;
                    break;
            case SI5351_CLK2:
                    // Check to see if PLLB is locked due to other output being < 1.024 MHz or >= 112.5 MHz
                    if(Si5351_Config.lock_pllb == SI5351_CLK1) {
                        // We can't have a 2nd output < 1.024 MHz  or >= 112.5 MHz on the same PLL unless exact same freq, so exit
                        if((freq >= SI5351_MULTISYNTH_SHARE_MAX * SI5351_FREQ_MULT
                                || freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 128)
                                && freq != Si5351_Config.clk2_freq) {
                            Si5351_Config.clk2_freq = 0;
                            return 1;
                        } else {
                            // Else, set multisynth to same PLL freq as CLK1
                            pll_freq = Si5351_Config.pllb_freq;
                            si5351_multisynth_calc(freq, pll_freq, &ms_reg);
                            write_pll = 0;
                            si5351_set_ms_source(SI5351_CLK2, SI5351_PLLB);
                        }
                    } else {
                        // need to account for CLK2 set before CLK1
                        Si5351_Config.pllb_freq = pll_freq;
                        pll_freq = si5351_multisynth_calc(freq, 0, &ms_reg);
                        write_pll = 1;
                        si5351_set_ms_source(SI5351_CLK2, SI5351_PLLB);
                    }

                    if(freq >= SI5351_MULTISYNTH_SHARE_MAX * SI5351_FREQ_MULT 
                            || freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 128) {
                        Si5351_Config.lock_pllb = SI5351_CLK2;

                        if(Si5351_Config.clk1_freq != 0) {
                            // Recalc and rewrite the multisynth parameters on CLK1
                            struct Si5351RegSet ms_temp_reg;
                            r_div = si5351_select_r_div(&Si5351_Config.clk1_freq);
                            si5351_multisynth_calc(Si5351_Config.clk1_freq, Si5351_Config.pllb_freq, &ms_temp_reg);
                            si5351_set_ms(SI5351_CLK1, ms_temp_reg, 0, r_div, 0);
                        }
                    } else {
                        Si5351_Config.lock_pllb = SI5351_CLKNONE;
                    }

                    target_pll = SI5351_PLLB;
                    Si5351_Config.clk2_freq = freq;
                    break;
            default:
                    return 1;
        }
    }

    // Set multisynth registers (MS must be set before PLL)
    si5351_set_ms(clk, ms_reg, int_mode, r_div, div_by_4);

    // Set PLL if necessary
    if (write_pll == 1) {
        si5351_set_pll(pll_freq, target_pll);
    }

    return 0;
}

/*------------------------------------------------------------------------------
 * @brief si5351_set_pll(uint64_t pll_freq, enum si5351_pll target_pll)
 *
 * Set the specified PLL to a specific oscillation frequency
 *
 * @param pll_freq - Desired PLL frequency
 * 
 * @param target_pll - Which PLL to set
 *     (use the si5351_pll enum)
 *------------------------------------------------------------------------------
 */
void si5351_set_pll(uint64_t pll_freq, enum si5351_pll target_pll) {
  struct Si5351RegSet pll_reg;

  si5351_pll_calc(pll_freq, &pll_reg, Si5351_Config.ref_correction);

  // Derive the register values to write

