drowe67/codec2-dev/codec2-dev/stm32/src/si53xx.c
  // Prepare an array for parameters to be written to
  uint8_t *params;
  uint8_t buffer[20];
  uint8_t i = 0;
  uint8_t temp;
  params = (uint8_t *)&buffer;

  // Registers 26-27
  temp = ((pll_reg.p3 >> 8) & 0xFF);
  params[i++] = temp;

  temp = (uint8_t)(pll_reg.p3  & 0xFF);
  params[i++] = temp;

  // Register 28
  temp = (uint8_t)((pll_reg.p1 >> 16) & 0x03);
  params[i++] = temp;

  // Registers 29-30
  temp = (uint8_t)((pll_reg.p1 >> 8) & 0xFF);
  params[i++] = temp;

  temp = (uint8_t)(pll_reg.p1  & 0xFF);
  params[i++] = temp;

  // Register 31
  temp = (uint8_t)((pll_reg.p3 >> 12) & 0xF0);
  temp += (uint8_t)((pll_reg.p2 >> 16) & 0x0F);
  params[i++] = temp;

  // Registers 32-33
  temp = (uint8_t)((pll_reg.p2 >> 8) & 0xFF);
  params[i++] = temp;

  temp = (uint8_t)(pll_reg.p2  & 0xFF);
  params[i++] = temp;

  // Write the parameters
  if (target_pll == SI5351_PLLA) {
    si5351_write_bulk(SI5351_PLLA_PARAMETERS, i, params);
  } else if (target_pll == SI5351_PLLB) {
    si5351_write_bulk(SI5351_PLLB_PARAMETERS, i, params);
  }
}




/*------------------------------------------------------------------------------
 * @brief  si5351_pll_reset(enum si5351_pll target_pll)
 * target_pll - Which PLL to reset
 *     (use the si5351_pll enum)
 *
 * Apply a reset to the indicated PLL.
 * @param SI5351_PLL_RESET_A or SI5351_PLL_RESET_B
 * 
 * @return none
 *------------------------------------------------------------------------------
 */
void si5351_pll_reset(enum si5351_pll target_pll) {
    if(target_pll == SI5351_PLLA) {
        si5351_write(SI5351_PLL_RESET, SI5351_PLL_RESET_A);
    } else if(target_pll == SI5351_PLLB) {
        si5351_write(SI5351_PLL_RESET, SI5351_PLL_RESET_B);
    }
}

/*------------------------------------------------------------------------------
 * @brief set_int(enum si5351_clock clk, uint8_t int_mode)
 * Set the indicated multisynth into integer mode.
 *
 * @param clk - Clock output
 *   (use the si5351_clock enum)
 * 
 * @param enable - Set to 1 to enable, 0 to disable
 *
 *------------------------------------------------------------------------------
 */
void si5351_set_int(enum si5351_clock clk, uint8_t enable){
    uint8_t reg_val;
    reg_val = si5351_read(SI5351_CLK0_CTRL + (uint8_t)clk);

    if(enable == 1) {
            reg_val |= (SI5351_CLK_INTEGER_MODE);
    } else {
            reg_val &= ~(SI5351_CLK_INTEGER_MODE);
    }

    si5351_write(SI5351_CLK0_CTRL + (uint8_t)clk, reg_val);

    // Integer mode indication
    switch(clk) {
	case SI5351_CLK0:
		Si5351_Config.clk0_int_mode = enable;
		break;
	case SI5351_CLK1:
		Si5351_Config.clk1_int_mode = enable;
		break;
	case SI5351_CLK2:
		Si5351_Config.clk2_int_mode = enable;
		break;
	default:
		break;
    }
}


/*------------------------------------------------------------------------------
 * @brief si5351_set_clock_pwr(enum si5351_clock clk, uint8_t pwr)
 * Enable or disable power to a clock output (a power
 * saving feature).
 *
 * @param clk - Clock output
 *   (use the si5351_clock enum)
 * 
 * @param pwr - Set to 1 to enable, 0 to disable
 *
 *------------------------------------------------------------------------------
 */
void si5351_set_clock_pwr(enum si5351_clock clk, uint8_t pwr) {
    uint8_t reg_val;
    reg_val = si5351_read(SI5351_CLK0_CTRL + (uint8_t)clk);
    if(pwr == 1) {
        reg_val &= 0b01111111;
    } else {
        reg_val |= 0b10000000;
    }
    si5351_write(SI5351_CLK0_CTRL + (uint8_t)clk, reg_val);
}

/*------------------------------------------------------------------------------
 * @brief si5351_set_clock_invert(enum si5351_clock clk, uint8_t inv)
 * Enable to invert the clock output waveform.
 *
 * @param clk - Clock output
 *   (use the si5351_clock enum)
 * 
 * @param inv - Set to 1 to enable, 0 to disable
 *
 * -----------------------------------------------------------------------------
 */
void si5351_set_clock_invert(enum si5351_clock clk, uint8_t inv) {
    uint8_t reg_val;
    reg_val = si5351_read(SI5351_CLK0_CTRL + (uint8_t)clk);
    if(inv == 1) {
        reg_val |= (SI5351_CLK_INVERT);
    } else {
        reg_val &= ~(SI5351_CLK_INVERT);
    }
    si5351_write(SI5351_CLK0_CTRL + (uint8_t)clk, reg_val);
}


/*------------------------------------------------------------------------------
 * @brief si5351_set_ms(enum si5351_clock clk, struct Si5351RegSet ms_reg,
 *  uint8_t int_mode, uint8_t r_div, uint8_t div_by_4)
 *
 * Set the specified multisynth parameters. Not normally needed, but public for advanced users.
 *
 * @param clk - Clock output
 *   (use the si5351_clock enum)
 * 
 * @param int_mode - Set integer mode
 *  Set to 1 to enable, 0 to disable
 * 
 * @param r_div - Desired r_div ratio
 * 
 * @param div_by_4 - Set Divide By 4 mode
 *   Set to 1 to enable, 0 to disable
 *------------------------------------------------------------------------------
 */
void si5351_set_ms(enum si5351_clock clk, struct Si5351RegSet ms_reg, uint8_t int_mode, uint8_t r_div, uint8_t div_by_4) {
    uint8_t *params;
    uint8_t buffer[20];
    uint8_t i = 0;
    uint8_t temp;
    uint8_t reg_val;

    params = (uint8_t *)&buffer;
    // Registers 42-43 for CLK0
    temp = (uint8_t)((ms_reg.p3 >> 8) & 0xFF);
    params[i++] = temp;

    temp = (uint8_t)(ms_reg.p3  & 0xFF);
    params[i++] = temp;

    // Register 44 for CLK0
    reg_val = si5351_read((SI5351_CLK0_PARAMETERS + 2) + (clk * 8));
    reg_val &= ~(0x03);
    temp = reg_val | ((uint8_t)((ms_reg.p1 >> 16) & 0x03));
    params[i++] = temp;

    // Registers 45-46 for CLK0
    temp = (uint8_t)((ms_reg.p1 >> 8) & 0xFF);
    params[i++] = temp;

    temp = (uint8_t)(ms_reg.p1  & 0xFF);
    params[i++] = temp;

    // Register 47 for CLK0
    temp = (uint8_t)((ms_reg.p3 >> 12) & 0xF0);
    temp += (uint8_t)((ms_reg.p2 >> 16) & 0x0F);
    params[i++] = temp;

    // Registers 48-49 for CLK0
    temp = (uint8_t)((ms_reg.p2 >> 8) & 0xFF);
    params[i++] = temp;

    temp = (uint8_t)(ms_reg.p2  & 0xFF);
    params[i++] = temp;

