drowe67/codec2-dev/codec2-dev/stm32/src/si53xx.c
    // Write the parameters
    switch (clk) {
        case SI5351_CLK0:
                si5351_write_bulk(SI5351_CLK0_PARAMETERS, i, params);
                break;
        case SI5351_CLK1:
                si5351_write_bulk(SI5351_CLK1_PARAMETERS, i, params);
                break;
        case SI5351_CLK2:
                si5351_write_bulk(SI5351_CLK2_PARAMETERS, i, params);
                break;
        case SI5351_CLK3:
                si5351_write_bulk(SI5351_CLK3_PARAMETERS, i, params);
                break;
        case SI5351_CLK4:
                si5351_write_bulk(SI5351_CLK4_PARAMETERS, i, params);
                break;
        case SI5351_CLK5:
                si5351_write_bulk(SI5351_CLK5_PARAMETERS, i, params);
                break;
        case SI5351_CLK6:
                si5351_write_bulk(SI5351_CLK6_PARAMETERS, i, params);
                break;
        case SI5351_CLK7:
                si5351_write_bulk(SI5351_CLK7_PARAMETERS, i, params);
                break;
        case SI5351_CLKNONE:
                return;
    }

    si5351_set_int(clk, int_mode);
    si5351_ms_div(clk, r_div, div_by_4);
}

void si5351_ms_div(enum si5351_clock clk, uint8_t r_div, uint8_t div_by_4) {
    uint8_t reg_val, reg_addr;

    switch(clk) {
        case SI5351_CLK0:
                reg_addr = SI5351_CLK0_PARAMETERS + 2;
                break;
        case SI5351_CLK1:
                reg_addr = SI5351_CLK1_PARAMETERS + 2;
                break;
        case SI5351_CLK2:
                reg_addr = SI5351_CLK2_PARAMETERS + 2;
                break;
        case SI5351_CLK3:
                reg_addr = SI5351_CLK3_PARAMETERS + 2;
                break;
        case SI5351_CLK4:
                reg_addr = SI5351_CLK4_PARAMETERS + 2;
                break;
        case SI5351_CLK5:
                reg_addr = SI5351_CLK5_PARAMETERS + 2;
                break;
        case SI5351_CLK6:
                return;
        case SI5351_CLK7:
                return;
        case SI5351_CLKNONE:
                return;
    }

    reg_val = si5351_read(reg_addr);

    // Clear the relevant bits
    reg_val &= ~(0x7c);

    if(div_by_4 == 0) {
            reg_val &= ~(SI5351_OUTPUT_CLK_DIVBY4);
    } else {
            reg_val |= (SI5351_OUTPUT_CLK_DIVBY4);
    }

    reg_val |= (r_div << SI5351_OUTPUT_CLK_DIV_SHIFT);

    si5351_write(reg_addr, reg_val);
}

/*------------------------------------------------------------------------------
 * @brief set_ms_source(enum si5351_clock clk, enum si5351_pll pll)
 * Set the desired PLL source for a multisynth.
 *
 * @param clk - Clock output
 *   (use the si5351_clock enum)
 * 
 * @param pll - Which PLL to use as the source
 *     (use the si5351_pll enum)
 *
 *------------------------------------------------------------------------------
 */
void si5351_set_ms_source(enum si5351_clock clk, enum si5351_pll pll) {
    uint8_t reg_val;

    reg_val = si5351_read(SI5351_CLK0_CTRL + (uint8_t)clk);

    if(pll == SI5351_PLLA) {
            reg_val &= ~(SI5351_CLK_PLL_SELECT);
    } else if (pll == SI5351_PLLB) {
            reg_val |= SI5351_CLK_PLL_SELECT;
    }
    si5351_write(SI5351_CLK0_CTRL + (uint8_t)clk, reg_val);
}

uint64_t si5351_multisynth_calc(uint64_t freq, uint64_t pll_freq, struct Si5351RegSet *reg) {
    uint64_t lltmp;
    uint32_t a, b, c, p1, p2, p3;
    uint8_t divby4;
    uint8_t ret_val = 0;

    // Multisynth bounds checking
    if (freq > SI5351_MULTISYNTH_MAX_FREQ * SI5351_FREQ_MULT) {
        freq = SI5351_MULTISYNTH_MAX_FREQ * SI5351_FREQ_MULT;
    }
    if (freq < SI5351_MULTISYNTH_MIN_FREQ * SI5351_FREQ_MULT) {
        freq = SI5351_MULTISYNTH_MIN_FREQ * SI5351_FREQ_MULT;
    }

    divby4 = 0;
    if (freq >= SI5351_MULTISYNTH_DIVBY4_FREQ * SI5351_FREQ_MULT) {
        divby4 = 1;
    }

    if(pll_freq == 0) {
        // Find largest integer divider for max
        // VCO frequency and given target frequency
        if(divby4 == 0) {
            lltmp = SI5351_PLL_VCO_MAX * SI5351_FREQ_MULT;
            do_div(lltmp, freq);
            a = (uint32_t)lltmp;
        } else {
            a = 4;
        }

        b = 0;
        c = 1;
        pll_freq = a * freq;
    } else {
        // Preset PLL, so return the actual freq for these params instead of PLL freq
        ret_val = 1;
        // Determine integer part of feedback equation
        a = pll_freq / freq;
        if (a < SI5351_MULTISYNTH_A_MIN) {
            freq = pll_freq / SI5351_MULTISYNTH_A_MIN;
        }
        if (a > SI5351_MULTISYNTH_A_MAX) {
            freq = pll_freq / SI5351_MULTISYNTH_A_MAX;
        }
        b = (pll_freq % freq * RFRAC_DENOM) / freq;
        c = b ? RFRAC_DENOM : 1;
    }

    // Calculate parameters
    if (divby4 == 1) {
        p3 = 1;
        p2 = 0;
        p1 = 0;
    } else {
        p1 = 128 * a + ((128 * b) / c) - 512;
        p2 = 128 * b - c * ((128 * b) / c);
        p3 = c;
    }

    reg->p1 = p1;
    reg->p2 = p2;
    reg->p3 = p3;

    if(ret_val == 0) {
        return pll_freq;
    } else {
        return freq;
    }
}

uint64_t si5351_pll_calc(uint64_t freq, struct Si5351RegSet *reg, int32_t correction) {
    uint64_t ref_freq = Si5351_Config.xtal_freq * SI5351_FREQ_MULT;
    uint32_t a, b, c, p1, p2, p3;
    uint64_t lltmp, rfrac, denom;


    // Factor calibration value into nominal crystal frequency
    // Measured in parts-per-billion

    ref_freq = ref_freq + (int32_t)((((((int64_t)correction) << 31) / 1000000000LL) * ref_freq) >> 31);

    // PLL bounds checking
    if (freq < SI5351_PLL_VCO_MIN * SI5351_FREQ_MULT) {
        freq = SI5351_PLL_VCO_MIN * SI5351_FREQ_MULT;
    }
    if (freq > SI5351_PLL_VCO_MAX * SI5351_FREQ_MULT) {
        freq = SI5351_PLL_VCO_MAX * SI5351_FREQ_MULT;
    }

    // Determine integer part of feedback equation
    a = freq / ref_freq;

    if (a < SI5351_PLL_A_MIN) {
        freq = ref_freq * SI5351_PLL_A_MIN;
    }
    if (a > SI5351_PLL_A_MAX) {
        freq = ref_freq * SI5351_PLL_A_MAX;
    }

    // Find best approximation for b/c = fVCO mod fIN
    denom = 1000ULL * 1000ULL;
    lltmp = freq % ref_freq;
    lltmp *= denom;
    do_div(lltmp, ref_freq);
    rfrac = lltmp;

